Учет_документов_20_Develop.ДокументыИТорги/src/Documents/РасшДТ_ВедомостьПередачиДокументов/РасшДТ_ВедомостьПередачиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасшДТ_ВедомостьПередачиДокументов</name>
  <registerRecords>AccumulationRegister.РасшДТ_ОборотыПоПодаркам</registerRecords>
  <registerRecords>InformationRegister.РасшДТ_КомуОтвезлиПодарки</registerRecords>
  <registerRecords>InformationRegister.РасшДТ_ДоставкаДокументовКурьером</registerRecords>
  <attributes>
    <name>ДокументыРазвозил</name>
    <type>
      <types>CatalogRef.РасшДТ_НашиСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок1</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок2</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подарок3</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиПодарков</name>
    <comment>Надо проверить отвозили ли этому клиенту подарок до определенной даты</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРазвозитьПодарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_СписокРазвоза</name>
    <attributes>
      <name>ПолучательДокументов</name>
      <type>
        <types>CatalogRef.РасшДТ_Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераАктов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераУПД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомераДоговоров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛУРВы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КомплектПоставки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СводныйАкт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктСверки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпециальнаяДоставка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подарок1</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подарок2</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подарок3</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОполучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТелПолучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УровеньКлиента</name>
      <type>
        <types>EnumRef.РасшДТ_УровеньКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОбеда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_документов_20_Develop.ДокументыИТорги/src/InformationRegisters/РасшДТ_КомуОтвезлиПодарки/РасшДТ_КомуОтвезлиПодарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасшДТ_КомуОтвезлиПодарки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подарок1</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Подарок1Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подарок2</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Подарок2Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подарок3</name>
    <type>
      <types>CatalogRef.РасшДТ_ПодаркиДляКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Подарок3Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДокументыРазвозил</name>
    <type>
      <types>CatalogRef.РасшДТ_НашиСотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверкиПодарков</name>
    <comment>Надо проверить отвозили ли этому клиенту подарок до определенной даты</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРазвозитьПодарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПолучательДокументов</name>
    <type>
      <types>CatalogRef.РасшДТ_Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_документов_20_Develop.ДокументыИТорги/src/Catalogs/РасшДТ_Клиенты/РасшДТ_Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РасшДТ_Клиенты</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОполучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКлиента</name>
    <type>
      <types>EnumRef.РасшДТ_УровеньКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОбеда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Учет_документов_20_Develop.ДокументыИТорги/src/Documents/РасшДТ_ВедомостьПередачиДокументов/Forms/ФормаДокумента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии GNU GENERAL PUBLIC LICENSE
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.АвторДокумента = Пользователи.ТекущийПользователь() ;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок1,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок2,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок3,
		|	КомуОтвезлиПодаркиСрезПоследних.ДокументыРазвозил,
		|	КомуОтвезлиПодаркиСрезПоследних.ДатаПроверкиПодарков,
		|	КомуОтвезлиПодаркиСрезПоследних.ВремяРазвозитьПодарки
		|ИЗ
		|	РегистрСведений.РасшДТ_КомуОтвезлиПодарки.СрезПоследних КАК КомуОтвезлиПодаркиСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Подарок1 = ВыборкаДетальныеЗаписи.Подарок1;
		Объект.Подарок2 = ВыборкаДетальныеЗаписи.Подарок2;
		Объект.Подарок3 = ВыборкаДетальныеЗаписи.Подарок3;
		Объект.ДокументыРазвозил = ВыборкаДетальныеЗаписи.ДокументыРазвозил;
		Объект.ДатаПроверкиПодарков = ВыборкаДетальныеЗаписи.ДатаПроверкиПодарков;
		Объект.ВремяРазвозитьПодарки = ВыборкаДетальныеЗаписи.ВремяРазвозитьПодарки;
	КонецЦикла;
	
		
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ТЧ_СписокРазвозаПолучательДокументовПриИзменении(Элемент)
	ЗаполнитьРеквизитыКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаНомераАктовПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаНомераУПДПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаНомераДоговоровПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаЛУРВыПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаКомплектПоставкиПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаСводныйАктПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаАктСверкиПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаСпециальнаяДоставкаПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПодарок1ПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПодарок2ПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПодарок3ПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьРеквизитыКлиента()
	Перем СтрокаТаблицы;
	Перем Обед;
	Перем Пробел;
	Перем РеквизитыКлиентаВСтруктуре;
	Перем СсылкаНаКлиента;
	СсылкаНаКлиента = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные.ПолучательДокументов;
	РеквизитыКлиентаВСтруктуре = РеквизитыКлиента(СсылкаНаКлиента);
	
	Если (ПустаяСтрока(РеквизитыКлиентаВСтруктуре.ВремяОбеда)) Тогда
		Обед = ""
	Иначе
		Обед = "Обед"
		
	КонецЕсли;
		
	Пробел = " ";
	СтрокаТаблицы = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные;
	СтрокаТаблицы.Адрес = РеквизитыКлиентаВСтруктуре.Адрес + Пробел + Обед + Пробел + РеквизитыКлиентаВСтруктуре.ВремяОбеда;
	СтрокаТаблицы.ФИОполучателя = РеквизитыКлиентаВСтруктуре.ФИОполучателя;
	СтрокаТаблицы.ТелПолучателя = РеквизитыКлиентаВСтруктуре.ТелПолучателя;
	СтрокаТаблицы.УровеньКлиента = РеквизитыКлиентаВСтруктуре.УровеньКлиента;
	СтрокаТаблицы.ВремяОбеда = РеквизитыКлиентаВСтруктуре.ВремяОбеда;
КонецПроцедуры

&НаСервере
Функция РеквизитыКлиента(СсылкаНаСправочник)
	РеквизитыВСтруктуре = Новый Структура();
			
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Клиенты.Адрес,
		|	Клиенты.ФИОполучателя,
		|	Клиенты.ТелПолучателя,
		|	Клиенты.УровеньКлиента,
		|	Клиенты.ВремяОбеда
		|ИЗ
		|	Справочник.РасшДТ_Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСправочник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока (ВыборкаДетальныеЗаписи.Следующий()) Цикл
	
		РеквизитыВСтруктуре.Вставить("Адрес",ВыборкаДетальныеЗаписи.Адрес);
		РеквизитыВСтруктуре.Вставить("ФИОполучателя",ВыборкаДетальныеЗаписи.ФИОполучателя);
		РеквизитыВСтруктуре.Вставить("ТелПолучателя",ВыборкаДетальныеЗаписи.ТелПолучателя);
		РеквизитыВСтруктуре.Вставить("УровеньКлиента",ВыборкаДетальныеЗаписи.УровеньКлиента);
		РеквизитыВСтруктуре.Вставить("ВремяОбеда",ВыборкаДетальныеЗаписи.ВремяОбеда);
		
		
	КонецЦикла;
	
	Возврат РеквизитыВСтруктуре;
	
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции

&НаКлиенте
Процедура ЗаполнениеПоляНаименование()
	СтрокаТаблицы = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные;
	СтрокаТаблицы.Наименование = "";
	Акт = "Акт ";
	УПД = " УПД ";
	Договор = " Договор ";
	ЛУРВы = " ЛУРВы ";
	СводныйАкт = " Сводный Акт ";
	КомплектПоставки = " Комплект Поставки ";
	АктСверки = " Акт Сверки ";
	Пробел = " ";
	Подарок1 = Объект.Подарок1;
	Подарок2 = Объект.Подарок2;
	Подарок3 = Объект.Подарок3;
	Если ЗначениеЗаполнено(СтрокаТаблицы.НомераАктов) Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Акт + СтрокаТаблицы.НомераАктов;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НомераУПД) Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + УПД + СтрокаТаблицы.НомераУПД;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НомераДоговоров) Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Договор + СтрокаТаблицы.НомераДоговоров;	
	КонецЕсли; 
	
	Если СтрокаТаблицы.ЛУРВы Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + ЛУРВы;	
	КонецЕсли;
	
	Если СтрокаТаблицы.СводныйАкт Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + СводныйАкт;	
	КонецЕсли;
	
	Если СтрокаТаблицы.КомплектПоставки Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + КомплектПоставки;	
	КонецЕсли;
	
	Если СтрокаТаблицы.АктСверки Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + АктСверки;	
	КонецЕсли;
	
	Если СтрокаТаблицы.Подарок1 Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Пробел + Подарок1;	
	КонецЕсли;
	
	Если СтрокаТаблицы.Подарок2 Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Пробел + Подарок2;	
	КонецЕсли;
	
	Если СтрокаТаблицы.Подарок3 Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Пробел + Подарок3;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.СпециальнаяДоставка) Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Пробел + СтрокаТаблицы.СпециальнаяДоставка;	
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
